# YOLOv5s with CASM attention, small-target detection layer, CIoU loss (configuration)
nc: 1  # number of classes (set later by data)
depth_multiple: 0.33
width_multiple: 0.50
anchors:
  - [10,13, 16,30, 33,23]   # P3/8
  - [30,61, 62,45, 59,119]  # P4/16
  - [116,90, 156,198, 373,326]  # P5/32
  - [5,6, 8,14, 15,11]      # extra small-target layer (P2/4)

backbone:
  # [from, number, module, args]
  [[-1, 1, Conv, [64, 6, 2, 2]],  # 0-P1/2
   [-1, 1, Conv, [128, 3, 2]],    # 1-P2/4
   [-1, 3, C3, [128]],
   [-1, 1, Conv, [256, 3, 2]],    # 3-P3/8
   [-1, 6, C3, [256]],
   [-1, 1, Conv, [512, 3, 2]],    # 5-P4/16
   [-1, 9, C3, [512]],
   [-1, 1, Conv, [1024, 3, 2]],   # 7-P5/32
   [-1, 3, C3, [1024]],
   [-1, 1, SPPF, [1024, 5]],      # 9
   # CASM inserted after SPPF
   [-1, 1, CASM, [1024]],         # 10
  ]

head:
  [[-1, 1, Conv, [512, 1, 1]],
   [-1, 1, nn.Upsample, [None, 2, 'nearest']],
   [[-1, 6], 1, Concat, [1]],     # cat backbone P4
   [-1, 3, C3, [512, False]],     # 13

   [-1, 1, Conv, [256, 1, 1]],
   [-1, 1, nn.Upsample, [None, 2, 'nearest']],
   [[-1, 4], 1, Concat, [1]],     # cat backbone P3
   [-1, 3, C3, [256, False]],     # 17 (P3/8-small)

   # Extra small-target layer from P2
   [-1, 1, Conv, [128, 1, 1]],
   [-1, 1, nn.Upsample, [None, 2, 'nearest']],
   [[-1, 2], 1, Concat, [1]],     # cat backbone P2
   [-1, 3, C3, [128, False]],     # 21 (P2/4-smaller)

   # Detection heads (P2, P3, P4, P5)
   [[21, 17, 13, 10], 1, Detect, [nc, anchors]],
  ]